function hh=lvboo(h1,d)
%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%
%函数功能去出二值图像的噪声。
%输入参数h1和d比表示一个二值图像和需要取掉的图像噪声连通区域的纵向跨度
%输出参数hh表示滤波后图像
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

hh=[];
for j=1:4
    [g,num]=bwlabel(h1,8); %找出8邻域连通域
    for i=1:num
        [r,c]=find(bwlabel(h1)==i); %逐个读取每个8邻域连通域的所在的行数和列数
        if (max(r)-min(r))<d%max(c)>350|min(c)<10|(max(r)-min(r))<d %去掉横向距离与纵向距离之比小于d的区域
            h1(r,c)=0;                         %这个比值可以调节,其效果影响较大
        end
    end
end
hh=h1;


%