/********************************************************************
 gif.c
 本文件用途： GIF图像读写模块实现文件
 读取功能：1~8位、静态或动态GIF图像
 保存功能：暂不提供保存功能
 本文件编写人： YZ
 本文件版本： 30813
 最后修改于： 2003-8-13
 ----------------------------------------------------------------
 修正历史：
 2003-8 容错处理，某些软件生成的图子图像块位深信息不完整()
 2003-6 修正上一版本中_get_imginfo函数被梦晖错误修改而造成某些文件读图像数据出错的问题
 测试图由yzfree提供()
 2003-6 修正_get_next_codeword中locde未初始化引起的内存访问违例
 去掉_decomp_LZW_to_BMP解码结束判断错误而强行引入的warninglevel
 容错处理_decomp_LZW_to_BMP的两处图像高度错误而引起的读取失败()
 2003-6 修正某些GIF图象未设延迟时间时本插件存在的BUG，以及某些图象未设置结尾
 标志时本插件缺乏的容错性，感谢 zggeng##163.com 网友做的测试工作。
 2003-5 修正读接口中有关图象位深度提取的代码（GIF文档在此处的说明有些模糊）
 修正局部色板尺寸计算的BUG（该BUG会导致某些GIF在读取时发生读位置偏移）
 （感谢 lanzhengpeng 和 waterflier 发现了这些BUG，并提供了测试样图）
 2003-4 修正透明色的处置方法，改进插件对用户中断的响应
 2003-4 读图象接口增加播放顺序表
 2003-3 支持图象读写引擎提供的象素缓冲区功能
 2003-3 修正读图象函数异常处理代码中存在的一处BUG
 2002-8 插件接口升级至2.2、增加了内存防护系统
 2001-12 修正了GIF-LZW解压算法中存在的一处错误，并
 加强了_get_imginfo()函数的容错性。(B01)
 2001-7 发布新版代码
 2000-9 第一个测试版发布
 2000-8 Sam编写了GIF读写库
********************************************************************/

/* 文件判别标志 */
#define GIF_MARKER_87a          ("GIF87a")
#define GIF_MARKER_89a          ("GIF89a")

/* GIF版本标识串长度 */
#define GIFVERSIZE          6

/*@@@@@@@@@@@@@@@GIF87a 和 GIF89a 共用的结构@@@@@@@@@@@@@@@@@@*/
typedef struct _tagGIFINFO      GIFINFO;
struct _tagGIFINFO {
  ushort FileType;      /* 89a or 87a */
  ushort ColorNum;      /* 颜色数 */
  ushort BitCount;      /* 图像的位深度 */
  ushort Width;
  ushort Height;
  ushort FrameCount;    /* 共有几幅图 */
  uchar  bkindex;       /* 背景色索引 */
  uchar  InitPixelBits; /* 压缩数据起始数据Bits位数 */
};

/* GIF调色板元素结构 */
typedef struct _tagGIFRGB     GIFRGB;
struct _tagGIFRGB {
  uchar bRed;
  uchar bGreen;
  uchar bBlue;
};

/* ISee调色板元素结构 */
typedef struct _tagISEERGB      ISEERGB;
struct _tagISEERGB {
  uchar bBlue;
  uchar bGreen;
  uchar bRed;
  uchar rev;
};

/* GIF图像头结构 */
typedef struct _tagGIFHEADER    GIFHEADER;
struct _tagGIFHEADER {
  uchar gif_type[GIFVERSIZE]; /* 图像版本(87a or 89a) */
  ushort  scr_width;        /* 逻辑屏宽度 */
  ushort  scr_height;       /* 逻辑屏高度 */
  uchar global_flag;        /* 全局标记 */
  uchar bg_color;           /* 背景色索引 */
  uchar aspect_radio;       /* 89a版的长宽比 */
};

/* 图像描述符 */
typedef struct _tagIMAGEDATAINFO  IMAGEDATAINFO;
struct _tagIMAGEDATAINFO {
  uchar label;            /* 标签值：0x2c */
  ushort  left;           /* 子图像左上角在逻辑屏幕中的位置 */
  ushort  top;
  ushort  width;
  ushort  height;
  uchar local_flag;       /* 本地位域 */
};

#define GIF_MAXCOLOR  256

/* GIF综合信息结构 */
typedef struct _tagGIFINSIDEINFO  GIFINSIDEINFO;
struct _tagGIFINSIDEINFO {
  int       type;         /* GIF版本：87a = 2 89a = 1 */

  ulong scr_width;        /* 逻辑屏信息 */
  ulong scr_height;
  ulong scr_bitcount;
  GIFRGB      p_pal[GIF_MAXCOLOR];  /* 全局调色板数据 */

  ulong first_img_width;      /* 首幅图像信息 */
  ulong first_img_height;
  ulong first_img_bitcount;
  GIFRGB      p_first_pal[GIF_MAXCOLOR];

  int       img_count;        /* 共有几幅图 */
  int       bk_index;         /* 背景色索引 */
};

#define LZWTABLESIZE  4096  /* GIF-LZW 串表尺寸 */

/* GIF-LZW 字典单元结构 */
typedef struct _tagLZWTABLE     LZWTABLE;
struct _tagLZWTABLE {
  short prefix;     /* 前缀码索引（无前缀码时为-1） */
  short code;       /* 尾码 */
  int   used;       /* 是否被占用标志：0－未占用，1－已占用 */
};


/* GIF-LZW编码单元 */
typedef union _tagCODEWORD      CODEWORD;
union _tagCODEWORD {
  uchar bcode[sizeof(ulong)];
  ulong lcode;
};

/*--------------------------------------------------------
  注：以下结构只适用于GIF89a格式的图像文件
--------------------------------------------------------*/

/* 图形控制扩展块 */
typedef struct _tagGRAPHCTRL    GRAPHCTRL;
struct _tagGRAPHCTRL {
  uchar extintr;        /* 0x21 */
  uchar label;          /* 0xF9 */
  uchar block_size;     /* 0x04 */
  uchar field;
  ushort delay_time;      /* 延迟时间 */
  uchar tran_color_index; /* 透明色索引 */
  uchar block_terminator; /* 0x00 */
};

/* 注释扩展块 */
typedef struct _tagNOTEHCTRL    NOTEHCTRL;
struct _tagNOTEHCTRL {
  uchar extintr;        /* 0x21 */
  uchar label;          /* 0xfe */
};

/* 文本扩展块 */
typedef struct _tagTEXTCTRL     TEXTCTRL;
struct _tagTEXTCTRL {
  uchar extintr;        /* 0x21 */
  uchar label;          /* 0x01 */
  uchar block_size;     /* 0x0c */
  ushort  left;
  ushort  top;
  ushort  width;
  ushort  height;
  uchar fore_color_index; /* 前景色索引 */
  uchar bk_color_index;   /* 背景色索引 */
};

/* 应用程序扩展块 */
typedef struct _tagAPPCTRL      APPCTRL;
struct _tagAPPCTRL {
  uchar extintr;        /* 0x21 */
  uchar label;          /* 0xff */
  uchar block_size;     /* 0xb  */
  uchar identifier[8];
  uchar authentication[3];
};

/* add by menghui 2003.06.18 */
#define MAXGIFBITS 12



/*==================================================================*/
/* 内部助手函数 */
/*==================================================================*/
/* 分配一个子图像节点，并初始化节点内数据 */
SUBIMGBLOCK* _gif_alloc_SUBIMGBLOCK(
    INFOSTR* pinfo_str,
    uchar* plzw, /* 图像块首地址 */
    uchar* stream, /* GIF流首地址 */
    GRAPHCTRL* p_imgctrl) /* 最近有效的图像控制扩展块 */
{
  GIFHEADER* p_header = (GIFHEADER*)stream;
  IMAGEDATAINFO* p_imginfo = (IMAGEDATAINFO*)plzw;
  GIFRGB* p_pal;
  int linesize, i, colorkey;
  SUBIMGBLOCK* p_subimg = 0;
  /* 申请子图像信息节点(SUBIMGBLOCK) */
  if ((p_subimg = _alloc_SUBIMGBLOCK(pinfo_str)) == 0) {
    return 0; /* 内存不足 */
  }
  /* 设置子图像节点数据 */
  p_subimg->left = (int)p_imginfo->left;
  p_subimg->top = (int)p_imginfo->top;
  p_subimg->width = (int)p_imginfo->width;
  p_subimg->height = (int)p_imginfo->height;
