// GIF图像读写模块实现文件
// 读取功能：1~8位、静态或动态GIF图像
// 保存功能：暂不提供保存功能

/* GIF版本标识串长度 */
#define GIFVERSIZE          6

struct _tagGIFHEADER;
typedef struct _tagGIFHEADER    GIFHEADER;
typedef struct _tagGIFHEADER*    LPGIFHEADER;

struct _tagGIFINFO;
typedef struct _tagGIFINFO      GIFINFO;
typedef struct _tagGIFINFO*      LPGIFINFO;

struct _tagGIFRGB;
typedef struct _tagGIFRGB     GIFRGB;
typedef struct _tagGIFRGB*     LPGIFRGB;

struct _tagISEERGB;
typedef struct _tagISEERGB      ISEERGB;
typedef struct _tagISEERGB*      LPISEERGB;

struct _tagIMAGEDATAINFO;
typedef struct _tagIMAGEDATAINFO  IMAGEDATAINFO;
typedef struct _tagIMAGEDATAINFO*  LPIMAGEDATAINFO;

struct _tagGIFINSIDEINFO;
typedef struct _tagGIFINSIDEINFO  GIFINSIDEINFO;
typedef struct _tagGIFINSIDEINFO*  LPGIFINSIDEINFO;

struct _tagLZWTABLE;
typedef struct _tagLZWTABLE     LZWTABLE;
typedef struct _tagLZWTABLE*     LPLZWTABLE;

union _tagCODEWORD;
typedef union _tagCODEWORD      CODEWORD;
typedef union _tagCODEWORD*      LPCODEWORD;

struct _tagGRAPHCTRL;
typedef struct _tagGRAPHCTRL    GRAPHCTRL;
typedef struct _tagGRAPHCTRL*    LPGRAPHCTRL;

struct _tagNOTEHCTRL;
typedef struct _tagNOTEHCTRL    NOTEHCTRL;
typedef struct _tagNOTEHCTRL*    LPNOTEHCTRL;

struct _tagTEXTCTRL;
typedef struct _tagTEXTCTRL     TEXTCTRL;
typedef struct _tagTEXTCTRL*     LPTEXTCTRL;

struct _tagAPPCTRL;
typedef struct _tagAPPCTRL      APPCTRL;
typedef struct _tagAPPCTRL*      LPAPPCTRL;


/*@@@@@@@@@@@@@@@GIF87a 和 GIF89a 共用的结构@@@@@@@@@@@@@@@@@@*/

struct _tagGIFINFO {
  unsigned short FileType;    /* 89a or 87a */
  unsigned short ColorNum;    /* 颜色数 */
  unsigned short BitCount;    /* 图像的位深度 */
  unsigned short Width;
  unsigned short Height;
  unsigned short FrameCount;    /* 共有几幅图 */
  unsigned char  bkindex;     /* 背景色索引 */
  unsigned char  InitPixelBits; /* 压缩数据起始数据Bits位数 */
};


/* GIF调色板元素结构 */
struct _tagGIFRGB {
  unsigned char bRed;
  unsigned char bGreen;
  unsigned char bBlue;
};

/* ISee调色板元素结构 */
struct _tagISEERGB {
  unsigned char bBlue;
  unsigned char bGreen;
  unsigned char bRed;
  unsigned char rev;
};

/* GIF图像头结构 */
struct _tagGIFHEADER {
  unsigned char gif_type[GIFVERSIZE]; /* 图像版本(87a or 89a) */
  unsigned short  scr_width;        /* 逻辑屏宽度 */
  unsigned short  scr_height;       /* 逻辑屏高度 */
  unsigned char global_flag;      /* 全局标记 */
  unsigned char bg_color;       /* 背景色索引 */
  unsigned char aspect_radio;     /* 89a版的长宽比 */
};


/* 图像描述符 */
struct _tagIMAGEDATAINFO {
  unsigned char label;          /* 标签值：0x2c */
  unsigned short  left;           /* 子图像左上角在逻辑屏幕中的位置 */
  unsigned short  top;
  unsigned short  width;
  unsigned short  height;
  unsigned char local_flag;       /* 本地位域 */
};

#define GIF_MAXCOLOR  256

/* GIF综合信息结构 */
struct _tagGIFINSIDEINFO {
  int       type;         /* GIF版本：87a = 2 89a = 1 */

  unsigned long scr_width;        /* 逻辑屏信息 */
  unsigned long scr_height;
  unsigned long scr_bitcount;
  GIFRGB      p_pal[GIF_MAXCOLOR];  /* 全局调色板数据 */

  unsigned long first_img_width;    /* 首幅图像信息 */
  unsigned long first_img_height;
  unsigned long first_img_bitcount;
  GIFRGB      p_first_pal[GIF_MAXCOLOR];

  int       img_count;        /* 共有几幅图 */
  int       bk_index;       /* 背景色索引 */
};


#define LZWTABLESIZE  4096  /* GIF-LZW 串表尺寸 */

/*  GIF-LZW 字典单元结构 */
struct _tagLZWTABLE {
  short prefix;     /* 前缀码索引（无前缀码时为-1） */
  short code;     /* 尾码 */
  int   used;     /* 是否被占用标志：0－未占用，1－已占用 */
};


/* GIF-LZW编码单元 */
union _tagCODEWORD {
  unsigned char bcode[sizeof(unsigned long)];
  unsigned long lcode;
};


/*--------------------------------------------------------
  注：以下结构只适用于GIF89a格式的图像文件
--------------------------------------------------------*/

/* 图形控制扩展块 */
struct _tagGRAPHCTRL {
  unsigned char extintr;      /* 0x21 */
  unsigned char label;        /* 0xF9 */
  unsigned char block_size;     /* 0x04 */
  unsigned char field;
  unsigned short  delay_time;     /* 延迟时间 */
  unsigned char tran_color_index; /* 透明色索引 */
  unsigned char block_terminator; /* 0x00 */
};

/* 注释扩展块 */
struct _tagNOTEHCTRL {
  unsigned char extintr;        /* 0x21 */
  unsigned char label;        /* 0xfe */
};

/* 文本扩展块 */
struct _tagTEXTCTRL {
  unsigned char extintr;      /* 0x21 */
  unsigned char label;        /* 0x01 */
  unsigned char block_size;     /* 0x0c */
  unsigned short  left;
  unsigned short  top;
  unsigned short  width;
  unsigned short  height;
  unsigned char fore_color_index; /* 前景色索引 */
  unsigned char bk_color_index;   /* 背景色索引 */
};

/* 应用程序扩展块 */
struct _tagAPPCTRL {
  unsigned char extintr;        /* 0x21 */
  unsigned char label;        /* 0xff */
  unsigned char block_size;     /* 0xb  */
  unsigned char identifier[8];
  unsigned char authentication[3];
};

/* add by menghui 2003.06.18 */
#define MAXGIFBITS 12


/*==================================================================*/
/* 内部助手函数 */
/*==================================================================*/


/* 读入静态GIF图像数据 */
int CALLAGREEMENT _load_static_gif(
    LPINFOSTR pinfo_str,
    unsigned char* stream,
    unsigned long stream_len,
    LPGIFINSIDEINFO p_info)
{
  assert(pinfo_str->imgtype == IMT_RESSTATIC);

  /* 以子图象方式读入主图象 */
  if (_load_subimg_serial(pinfo_str, stream, stream_len) == -1) {
    return -1;
  }

  assert(pinfo_str->imgnumbers == 1);

  /* 将图象数据从子图象结构中移到主图象结构 */
  memcpy((void*)pinfo_str->palette, (const void*)pinfo_str->psubimg->palette, sizeof(unsigned long)*MAX_PALETTE_COUNT);
  pinfo_str->pal_count = pinfo_str->psubimg->pal_count;
  pinfo_str->pp_line_addr = pinfo_str->psubimg->pp_line_addr;
